int bulbSwitch(int n){

  for(int i=0;  ; i++){ //第i層, 下底對應個數是 i*2+1, 高是i+1
    //int area = (1+ i*2+1)*(i+1)/2;
    //if(area>n) return i; //這個寫法可以通過

    //另一種寫法, 因為第1項是 i*i, 所以只要 i*i>n , 把 i-1當答案即可
    if(i*i>n) return i-1;

  }
  return 0;
}
//6個
// 0 0 0 0 0 0
// 1 1 1 1 1 1 first toggle 1-th
// 1 0 1 0 1 0 second toggle 2-th
// 1 0 0 0 1 1 third toggle 3-th
// 1 0 0 1 1 1 toggle 4-th
// 1 0 0 1 0 1 toggle 5-th
// 1 0 0 1 0 0 toggle 6-th
//因為數字很大, 一定不能用暴力法去巡。所以要觀察規律
//1個 0:0 
//3個 1:1 2:1 3:1
//5個 4:2 5:2 6:2 7:2 8:2
//7個 9:3 10:3 11:3 12:3 13:3 14:3 15:3
//9個 16:4 ... 24:4
//11個 25:5 ...
//所以,就和三角形(梯形)面積有關, (1+下底)*高/2
//因為 10^9 答案是 31622, 所以只要 for迴圈去試到這麼大, 就可算到答案了。
